Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.SomeElementsNotCopiedWarn
Some elements were not copied.[Description]

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.PasteInvisibleInView
Selection is invisible in this view.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.NoSketchPlane
Can't paste because no Work Plane is defined in the View.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.LostReference
A relationship between Elements in [Option Name] and [Reference Option Name] has been deleted. There is no corresponding relationship in the Primary [New Primary Option Name].

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.FinalizedElementsWillBeModifiedWarn
Can't find some new hosts for this Element.\nIt will lose references on Finish Paste unless repositioned or rehosted.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.FinalizedElementsWillBeModified
Can't find some new hosts for this Element.\nIt will lose references on Finish Paste unless repositioned or rehosted.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.FinalizedElementsWillBeDeletedWarn
Can't find new hosts for this Element.\nIt will be deleted on Finish Paste unless repositioned or rehosted.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.FinalizedElementsWillBeDeleted
Can't find new hosts for this Element.\nIt will be deleted on Finish Paste unless repositioned or rehosted.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.ElementRenamedOnPaste
The loaded type "[Name]" has been renamed to "[New Name]" to avoid conflicts with the existing type.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CopyImposterLightWarn
Light source cannot be copied!

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CopyImposterLightError
Light source cannot be copied!

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CopyImposterContentWarn
Cannot copy Render Appearance.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CopyImposterContentError
Cannot copy Render Appearance.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CopingColumnBeamFailure
The support order for a beam/column connection has been changed.  When a beam is supported by a column that same beam cannot be coped by the column.  The existing coping has been removed.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CantCopySymbolicElementToSelfOrientingFamily
Cannot copy symbolic elements sketched in non-horizontal planes.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CantCopyStairsLevelHeightNotMatchInMS
Can't copy stairs in Multistory Stairs due to level height doesn't match.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CantCopyLevelsOrRefPlanesToNonMassFamily
Can't copy levels or reference planes to families that are not Mass families.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CantCopyFromDetailToProfileFam
Can't copy Detail element(s) into a Profile family.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CantCopyFrom3dTo2dFam
Can't copy 3D element(s) into a 2D family.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CantCopyFrom2dTo3dFam
Can't copy 2D element(s) into a 3D family.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CantCopyElemsToInplaceFam
Can't copy element(s) to In Place family.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CantCopyBetweenModelAndAnnotFam
Can't copy element(s) between Model and Annotation families.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotTransferProjectStandards
These Project Standards cannot be transferred.[Description]

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteViewSpecificElementsIntoPerspectiveView
Can't paste view specific elements into perspective view.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteViewSpecElemsFromDiffViews
Cannot paste view-specific elements from different views.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteToSheet
Elements copied to Sheets can only be copied from other Sheets.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteRoomsInNonPlanViews
[Rooms] can only be pasted in Plan or Ceiling Plan views.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteNoWorkplane
Can't paste because there is no corresponding Work Plane.  Set workplane or switch to view with appropriate workplane.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteNoLevelBelow
Can't paste these elements at this height because there is no Level below to reference.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteNoLevelAbove
Can't paste these elements at this height because there is no Level above to Reference.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteModelPlusViewSpecificElementsIntoView
Cannot paste view-specific model plus into view.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteInViewError
Can't paste current clipboard contents in [View Type] View.  Switch to appropriate view to paste.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteInView
Can't paste current clipboard contents in [View Type] View.  Switch to appropriate view to paste.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteInSketch
Can't paste elements into sketch.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteDifferentViewSpecificElements
Cannot paste view-specific elements from different views.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteCurtainGridLine
Can't paste Curtain Grid Line.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteCircularLinks
The pasted selection includes a linked instance of this file '[Name]'.  A file cannot link itself, so the link was not pasted.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteAssemblyView
Can't paste assembly view because its associated assembly instance is not available.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteAlignedSomeLevels
Can't Paste Aligned to some views.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteAlignedError
Can't Paste Align these elements in this view.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteAlignedCorruption
Can't Paste Aligned these elements in this view.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteAlignedAny
Can't Paste Aligned.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotFinalizeOrphanSerf
Can't finalize Group member without finalizing the entire Group.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotFinalizeClusterInconsistency
Can't finalize because dependent element failed to finalize.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotDuplicateWarn
Elements can't be duplicated

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotDuplicateType
Cannot Duplicate Type.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotDuplicateInOptionWarn
Elements can't be duplicated in a secondary Option

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotDuplicateInOption
Elements can't be duplicated in a secondary Option

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotDuplicateDesignOption
Can't duplicate Design Option.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotDuplicate
Elements can't be duplicated

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyZoneWarn
A Zone cannot be copied.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyZone
A Zone cannot be copied.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyWallPanelsWarn
Cannot copy wall panels unless their parent wall is also being copied.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyWallPanels
Cannot copy wall panels unless their parent wall is also being copied.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopySunAndShadowSettingsWarn
SunAndShadowSettings cannot be copied.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopySunAndShadowSettings
SunAndShadowSettings cannot be copied.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopySketchGridWarn
Work Planes cannot be copied.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopySketchGrid
Work Planes cannot be copied.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopySelection
Cannot copy selection.[Description]

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopySelectedPick
The element being dragged can't be copied.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyRevolveAxisWarn
The axis cannot be copied.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyRevolveAxis
The axis cannot be copied.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyNoReferences
Elements can't be copied because they will lose their References.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyNoParents
Can't Copy to Clipboard because of relationships between Elements

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyNoAttachedParentWarn
Attached Detail Group can't be copied without its Model Group

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyNoAttachedParent
Attached Detail Group can't be copied without its Model Group

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyNestedLinks
To copy a nested link, use Copy to Clipboard or Move Copy.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMustBeUniqueWarn
Element must be unique.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMustBeUniqueViewportWarn
Multiple instances of the same view in sheets not supported.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMustBeUniqueViewport
Multiple instances of the same view in sheets not supported.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMustBeUnique
Element must be unique.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMultipleSketchParents
Copying elements from unrelated Workplanes together is not supported in families.  Try copying elements separately.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMullionsWarn
Mullions and panels cannot be copied without copying the entire curtain wall.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMullionsError
Mullions and panels cannot be copied without copying the entire curtain wall.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMullions
Mullions and panels cannot be copied without copying the entire curtain wall.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMassingWarn
A massing cannot be copied. Copy the elements within the massing instead.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyMassing
A massing cannot be copied. Copy the elements within the massing instead.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyLockedWarn
Can't copy pinned element.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyLocked
Can't copy pinned element.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyJoinedGeometryWarn
Joined solid geometry cannot be copied as a whole. Instead, select the individual extrusions, etc., using Pick box or Ctrl-select and copy them.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyJoinedGeometry
Joined solid geometry cannot be copied as a whole. Instead, select the individual extrusions, etc., using Pick box or Ctrl-select and copy them.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyIncompleteElementWarn
Can't copy part of element

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyIncompleteElement
Can't copy part of element

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyImportInstancesAcrossProjects
Linked Imported Files cannot be copied across projects.  All non-RVT linked files will be pasted as imports instead.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyGridLinesWarn
Curtain grid lines cannot be copied.  If you are trying to copy the curtain wall, try using tab to select entire wall.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyGridLines
Curtain grid lines cannot be copied.  If you are trying to copy the curtain wall, try using tab to select entire wall.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyFromProjectAndLink
Can't Copy to Clipboard elements from the project and a link instance at the same time.  Only elements from the project will be copied.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyFamilyName
Can't [Action] because Family '[Family Name]' is different in the two documents. Update the documents to contain the same version of the Family.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyElevationArrowWarn
To duplicate Elevations, copy the elevation symbol in a plan view.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyElevationArrow
To duplicate Elevations, copy the elevation symbol in a plan view.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyDuplicates
Can't paste duplicate types. Only non duplicate types will be pasted.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyDetails
Can't copy some or all of the detailing with the view.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyDependentView
Dependent views cannot be copied.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyCurtainWallGridLines
Curtain wall grid lines currently cannot be copied.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyBetweenFamilyAndProjectError
Can't copy between Family and Project.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyBetweenFamilyAndProjectCorruption
Can't copy between Family and Project.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyAttachedTypeWarn
Cannot copy attached detail group type without copying the model group type it refers to.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyAttachedType
Cannot copy attached detail group type without copying the model group type it refers to.

Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures
Failures about CopyPasteFailures.